Tekla Open API Reference for Tekla Structures 2025
Distance.Parse Method (String, IFormatProvider)
 Parses a distance from a string representation using the current unit type and the given culture.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static Distance Parse(
	string text,
	IFormatProvider formatProvider
)
Public Shared Function Parse (
	text As String,
	formatProvider As IFormatProvider
) As Distance
Parameters
text
Type: System.String
The text to parse.
formatProvider
Type: System.IFormatProvider
The number format provider.
Return Value
Type: Distance
The representation of the specified distance.
Exceptions
Exception | Condition
FormatException | Thrown if the text does not represent a distance.
Examples
 This example shows how to specify a format provider when parsing a Distance instance from a string.
using Tekla.Structures.Datatype;
using System.Globalization;
public class Example
{
       public void Example1()
       {
           // Current unit type controls the default unit type used in parsing.
           // The default unit is millimeter.
           Distance.CurrentUnitType = Distance.UnitType.Millimeter;
           // Tekla Structures uses dot as the decimal separator in all locales.
           // This will be parsed as 30.2 millimeters.
           Distance distanceInMillimeters = Distance.Parse("30.2", CultureInfo.InvariantCulture);
           // If the distance contains the unit, the distance is converted automatically.
           // This will be parsed as 30.2 meters.
           Distance distanceInMeters = Distance.Parse("30.2m", CultureInfo.InvariantCulture);
       }
}
See Also
Reference
Distance Structure
Parse Overload
Tekla.Structures.Datatype Namespace